//==============================================================================================================
//
// クラフトUI [craftui.h]
// Author: TEAM_C
//
//==============================================================================================================

#ifndef _CRAFTUI_H_
#define _CRAFTUI_H_

//**************************************************************************************************************
// インクルードファイル
//**************************************************************************************************************
#include"main.h"

//**************************************************************************************************************
// マクロ定義
//**************************************************************************************************************
#define UIPOTISION (D3DXVECTOR3(600.0f, 400.0f, 0.0f)) // UIの位置

//**************************************************************************************************************
// UIの種類
//**************************************************************************************************************
typedef enum
{
	CRAFTUITYPE_BACKGROUND = 0,
	CRAFTUITYPE_CRAFT,
	CRAFTUITYPE_CLOSE,
	CRAFTUITYPE_MAX
}CRAFTUITYPE;

//**************************************************************************************************************
// UIのパスを保存
//**************************************************************************************************************
static const char* CRAFTUITYPE_INFO[CRAFTUITYPE_MAX] =
{
	"data\\TEXTURE\\createwepon_back.png",
	"data\\TEXTURE\\UI_craft.jpg",
	"data\\TEXTURE\\Ui_close.png",
};

//**************************************************************************************************************
// クラフトUIの構造体
//**************************************************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;	// 位置
	D3DXVECTOR3 move;	// 移動量
	D3DXVECTOR3 rot;	// 向き
	int nUseTime;		// 出てから消えるまでの時間
	int nType;			// 種類
	int nIconType;      // アイコンの種類
	float fWidth, fHeight; // 幅、高さ
	bool bUse;			// 使用状態
}Craftui;

//**************************************************************************************************************
// プロトタイプ宣言
//**************************************************************************************************************
void InitCraftUI(void);	 // UIの初期化処理
void UninitCraftUI(void); // UIの終了処理
void UpdateCraftUI(void); // UIの更新処理
void DrawCraftUI(void);	 // UIの描画処理
void SetCraftUI(D3DXVECTOR3 pos, int nType, float fWidth, float fHeight, int nUseTime);
void SetMixUI(D3DXVECTOR3 pos, int nType, float fWidth, float fHeight, int nUseTime);
void SetMixItemUI(int nCnt);
Craftui* GetMixUI(void);
#endif