//==============================================================================================================
//
// クラフトのヒント [craftsupport.h]
// Author: YOSHIDA YUTO
//
//==============================================================================================================

#ifndef _CRAFTSUPPORT_H_
#define _CRAFTSUPPORT_H_

//**************************************************************************************************************
// インクルードファイル
//**************************************************************************************************************
#include"main.h"

//**************************************************************************************************************
// マクロ定義
//**************************************************************************************************************

//**************************************************************************************************************
// クラフトレシピのテクスチャの種類
//**************************************************************************************************************
typedef enum
{
	RECIPETYPE_STONEBAT = 0,
	RECIPETYPE_FISH,
	RECIPETYPE_HEX,
	RECIPETYPE_HUMMER,
	RECIPETYPE_KATANA,
	RECIPETYPE_SPEAR,
	RECIPETYPE_TORSO,
	RECIPETYPE_MAX
}RECIPETYPE;

//**************************************************************************************************************
// クラフトレシピのテクスチャのファイルパス
//**************************************************************************************************************
static const char* RECIPE_TEXTURE[RECIPETYPE_MAX] =
{
	"data\\TEXTURE\\ui_Creat_bat.png",
	"data\\TEXTURE\\ui_Creat_fish.png",
	"data\\TEXTURE\\ui_Creat_hex.png",
	"data\\TEXTURE\\ui_Creat_hunmer.png",
	"data\\TEXTURE\\ui_Creat_katana.jpg",
	"data\\TEXTURE\\ui_Creat_spear.png",
	"data\\TEXTURE\\ui_Creat_torso.png",
};

//**************************************************************************************************************
// クラフトレシピの構造体
//**************************************************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;	  // 位置
	int nType;            // 種類
	float fWidth, fHeight; // 横幅、高さ
	bool bUse;            // 使用状態
	int state;            // 状態
}CraftRecipe;

//**************************************************************************************************************
// プロトタイプ宣言
//**************************************************************************************************************
void InitCraftRecipe(void);						// クラフトレシピの初期化処理
void UninitCraftRecipe(void);					// クラフトレシピの終了処理
void UpdateCraftRecipe(void);					// クラフトレシピの更新処理
void DrawCraftRecipe(void);						// クラフトレシピの描画処理
void SetCraftRecipe(D3DXVECTOR3 pos, int nType0, int nType1, float fWidth, float fHeight); // クラフトレシピの設定処理
void EnableRecipeUI(int nType, bool bUse); // クラフトレシピの有効無効処理
#endif