//=====================================================================================================================
//
// ダメージ表示関連処理 [ damegepop.h ]
// Author:長尾悠成
//
//=====================================================================================================================
#ifndef _DAMEGE_H_
#define _DAMEGE_H_

//*************************************
// インクルードファイル宣言
//*************************************
#include "main.h"

//*************************************
// プロトタイプ宣言
//*************************************
void InitDamege(void);   // ダメージポップの初期化処理
void UninitDamege(void); // ダメージポップの終了処理
void UpdateDamege(void); // ダメージポップの更新処理
void DrawDamege(void);   // ダメージポップの描画処理
void SetDamege(D3DXVECTOR3 pos, int nDamege, int nLife, bool Heal); // ダメージポップの設定処理

#endif