//===================================================================================================================
//
// エフェクト2d [effect2d.h]
// Author:YOSHIDA YUUTO
//
//===================================================================================================================

#ifndef _EFFECT2D_H_
#define _EFFECT2D_H_

//**************************************************************************************************************
// インクルードファイル
//**************************************************************************************************************
#include"main.h"

//**************************************************************************************************************
// エフェクト2D構造体
//**************************************************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;//位置
	D3DXVECTOR3 move;//移動量
	D3DXCOLOR col;//色
	float fRadius;//半径(大きさ)
	float fWidth;
	float fHeight;
	int nLife;//寿命(表示時間)
	bool bUse;//使用しているかどうか
	float DecAlv;	// アルファ値の減少スピード
}Effect2D;

//**************************************************************************************************************
// プロトタイプ宣言
//**************************************************************************************************************
void InitEffect2D(void);//エフェクト2Dの初期化処理
void UninitEffect2D(void);//エフェクト2Dの終了処理
void UpdateEffect2D(void);//エフェクト2Dの更新処理
void DrawEffect2D(void);//エフェクト2Dの描画処理
void SetEffect2D(D3DXVECTOR3 pos, D3DXVECTOR3 move, D3DXCOLOR col, float fRadius, int nLife);
Effect2D* GetEffect2D(void);
#endif
