//==============================================================================================================
//
// ランキング [ranking.cpp]
// Author: TEAM_C
//
//==============================================================================================================

//**************************************************************************************************************
//インクルードファイル
//**************************************************************************************************************
#include "ranking.h"
#include "input.h"
#include "fade.h"
#include <stdio.h>
#include "RankingScore.h"
#include "RankingSet.h"
#include "sound.h"
#include "mouse.h"

//**************************************************************************************************************
//グローバル変数宣言
//**************************************************************************************************************
int nRankingCount;	// タイマーカウント

//===============================================================================================================
//ランキングの初期化処理
//===============================================================================================================
void InitRanking(void)
{
	// 順位の初期化
	InitRankingSet();

	// スコアの初期化
	InitRankingScore();

	// ランキングのリセット
	ResetRanking();

	// スコアのテクスチャ設定
	RankingTexture();

	// グローバル変数の初期化
	nRankingCount = 0;

	// 音楽を再生
	PlaySound(SOUND_LABEL_RANKING_BGM);
}
//===============================================================================================================
//ランキングの終了処理
//===============================================================================================================
void UninitRanking(void)
{
	// 音楽を停止
	StopSound();

	// 順位の終了
	UninitRankingSet();
	
	// スコアの初期化
	UninitRankingScore();
}
//===============================================================================================================
//ランキングの更新処理
//===============================================================================================================
void UpdateRanking(void)
{
	// 順位の更新処理
	UpdateRankingSet();

	// スコアの更新処理
	UpdateRankingScore();

	// カウントを加算
	nRankingCount++;

	if (nRankingCount >= 600 || KeyboardTrigger(DIK_RETURN) || JoypadTrigger(JOYKEY_A) || OnMouseTriggerDown(LEFT_MOUSE))
	{// 10秒経過 or Enterキー or Aボタン or 左クリック
		// タイトル画面に遷移
		SetFade(MODE_TITLE);
	}
}
//===============================================================================================================
//ランキングの描画処理
//===============================================================================================================
void DrawRanking(void)
{
	// 順位の描画
	DrawRankingSet();

	// スコアの描画
	DrawRankingScore();
}
