//==============================================================================================================
//
// タイトル3d [title3d.h]
// Author: TEAM_C
//
//==============================================================================================================
#ifndef _TITLE3D_H_
#define _TITLE3D_H_

//****************************
// インクルードファイル
//****************************
#include"main.h"

//****************************
// プロトタイプ宣言
//****************************
void InitTitle3d(void);	  // タイトル3d画面の初期化処理
void UninitTitle3d(void); // タイトル3d画面の終了処理
void UpdateTitle3d(void); // タイトル3d画面の更新処理
void DrawTitle3d(void);   // タイトル3d画面の描画処理
#endif

